app/controllers/administrator_controller.rb

	def index
	  @administrator = Administrator.all
---
SELECT `administrators`.* FROM `administrators`

	def create
	  @administrator = Administrator.create(administrator_param)
	  if @administrator.save
---
INSERT INTO `administrators` (`username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('aditya', 'adite@gmail.com', '$2a$12$FhsgWQc6gSvPveHDlJcVJuoffcw6XyEFY3WWLZvofNn98Rf9S.N8i', '2020-09-20 14:08:05.251897', '2020-09-20 14:08:05.251897')
INSERT INTO `administrators` (`username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('zetc0de', 'zetc0de@gmail.com', '$2a$12$BX6rp8pKmpKWm0fLetkuC.D41BnI66kLKsqJYPHmGQUEhmCW4CfCy', '2020-09-17 13:18:24.557534', '2020-09-17 13:18:24.557534')