app/controllers/books_controller.rb

	def create

		#Create an API where user can book a schedule with doctor

		#The maximum user can book within 30 minutes before the doctor starts the schedule.

		#A total of 10 users can book the same doctor.

		@doctorSchedule = DoctorSchedule.where("id = ?", params[:book][:id_doctor_schedule])
		@schedule_day = @doctorSchedule.pluck(:schedule_day)
		@start_time = DateTime.parse(@doctorSchedule.pluck(:start_time).to_s)
		@day = Date.today.strftime("%A")
		@time1 = DateTime.now.to_s(:db)
		@time = DateTime.parse(@time1)

		@bookCount = Book.where("id_doctor_schedule = ?", params[:book][:id_doctor_schedule]).count

		@book = Book.create(book_param)

		if @day = @schedule_day
		   @timedif = TimeDifference.between(@start_time, @time).in_minutes
		   if @timedif > 30
		   	if @bookCount > 10
		   		render json: { result: 'maaf jumlah booking melebihi kapasitas maximal' }, status: :ok
		   	else
		   		if @book.save
---
SELECT `doctor_schedules`.* FROM `doctor_schedules` WHERE (id_doctor = '1')
SELECT `doctor_schedules`.`schedule_day` FROM `doctor_schedules` WHERE (id = '3')
SELECT `doctor_schedules`.`start_time` FROM `doctor_schedules` WHERE (id = '3')
SELECT COUNT(*) FROM `books` WHERE (id_doctor_schedule = '2')
INSERT INTO `books` (`id_doctor_schedule`, `id_administrator`, `state`, `created_at`, `updated_at`) VALUES (2, 1, 0, '2020-09-20 14:14:35.339375', '2020-09-20 14:14:35.339375')
INSERT INTO `books` (`id_doctor_schedule`, `id_administrator`, `state`, `created_at`, `updated_at`) VALUES (1, 1, 0, '2020-09-19 06:51:11.621530', '2020-09-19 06:51:11.621530')