app/controllers/doctor_controller.rb

SELECT `doctors`.* FROM `doctors`
---
	def index
		@doctor = Doctor.all