app/controllers/hospitals_controller.rb

	def index
		@hospital = Hospital.all
---
SELECT `hospitals`.* FROM `hospitals`